; domain
(define (domain move-pickup)
  (:requirements :strips :typing)

  (:types
    robot location object
  )

  (:predicates
    (at ?robot - robot ?location - location)
    (at-object ?object - object ?location - location)
    (holding ?robot - robot ?object - object)
  )

  (:action move
    :parameters (?robot - robot ?from - location ?to - location)
    :precondition (at ?robot ?from)
    :effect (and (not (at ?robot ?from))
                 (at ?robot ?to))
  )

  (:action pick-up
    :parameters (?robot - robot ?object - object ?location - location)
    :precondition (and (at ?robot ?location)
                       (at-object ?object ?location))
    :effect (and (not (at-object ?object ?location))
                 (holding ?robot ?object))
  )

  (:action drop
    :parameters (?robot - robot ?object - object ?location - location)
    :precondition (and (at ?robot ?location)
                       (holding ?robot ?object))
    :effect (and (at-object ?object ?location)
                 (not (holding ?robot ?object)))
  )
)

; problem
(define (problem move-pickup-problem)
  (:domain move-pickup)

  (:objects
    robot1 - robot
    locationA locationB locationC - location
    box1 - object
  )

  (:init
    (at robot1 locationA)
    (at-object box1 locationB)
  )

  (:goal
    (and
      (at robot1 locationA)
      (at-object box1 locationC)
    )
  )
)

; plan
1. (move robot1 locationa locationb)
   deleted: (at robot1 locationa)
   added: (at robot1 locationb)
   goals met: 0 of 2
2. (pick-up robot1 box1 locationb)
   deleted: (at-object box1 locationb)
   added: (holding robot1 box1)
   goals met: 0 of 2
3. (move robot1 locationb locationc)
   deleted: (at robot1 locationb)
   added: (at robot1 locationc)
   goals met: 0 of 2
4. (drop robot1 box1 locationc)
   deleted: (holding robot1 box1)
   added: (at-object box1 locationc)
   goals met: 1 of 2
5. (move robot1 locationc locationa)
   deleted: (at robot1 locationc)
   added: (at robot1 locationa)
   goals met: 2 of 2
